
tree_tables = [
	'category',
	'product',
	'model'
]

client = 'client'

order = 'order'

sequency_start = 1000000000

values = {
	'categories': (
		('Бытовая техника',),
		('Компьютеры',),
		('Телефоны',)
	),
	'products': (
		('Холодильники', 'Бытовая техника'),
		('Пылесосы', 'Бытовая техника'),
		('Утюги', 'Бытовая техника'),
		('Ноутбуки', 'Компьютеры'),
		('Моноблоки', 'Компьютеры'),
		('Мобильные', 'Телефоны'),
		('Стационарные', 'Телефоны'),
		('Факсы', 'Телефоны')
	),
	'models': (
		('Indesit', 'Холодильники', 2),
		('Beko', 'Холодильники', 1),
		('Haier', 'Пылесосы', 3),
		('Bosch', 'Пылесосы', 5),
		('Vestel', 'Пылесосы', 2),
		('Tefal', 'Утюги', 4),
		('Sony', 'Ноутбуки', 3),
		('Lenovo', 'Ноутбуки', 5),
		('Samsung', 'Ноутбуки', 2),
		('Apple', 'Ноутбуки', 6),
		('Toshiba', 'Моноблоки', 5),
		('Honor', 'Мобильные', 3),
		('Xiaomy', 'Мобильные', 1),
		('Meizu', 'Мобильные', 6),
		('Philips', 'Стационарные', 9),
		('Xerox', 'Факсы', 7)
	),
	'clients': (
		('Иван', 'Иванов', 'Москва'),
		('Олег', 'Титов', 'Пермь'),
		('Андрей', 'Иванов', 'Киржач'),
		('Сергей', 'Кривов', 'Воронеж')
	),
	'orders': (
		(1000000002, 'Honor'),
		(1000000002, 'Samsung'),
		(1000000001, 'Xerox'),
		(1000000003, 'Xerox'),
		(1000000004, 'Toshiba'),
		(1000000003, 'Bosch'),
		(1000000002, 'Bosch'),
		(1000000004, 'Sony')
	)
}

